{
    "general": {
        "summary": "Summary",
        "link": "Link"
    },
    "menu": {
        "home": "Home",
        "about": "About me",
        "projects": "Projects",
        "resources": "Resources",
        "academic": "Academic",
        "skills": "Skills",
        "contact": "Contact me"
    },
    "home": {
        "welcome": "WELCOME TO",
        "authorName": "MIRKÓ RÁCZ",
        "welcomeMsg": "'s portfolio website!",
        "aboutDesc": "Being a Computer Science graduate I wanted to share my passion for CS with anyone interested.",
        "aboutTitle": "Computer Science",
        "about": "What's this site about?",
        "cards": {
            "projects": {
                "title": "Projects",
                "description": "Explore my personal IT projects in great detail with specifications and images for a concise picture."
            },
            "resources": {
                "title": "Resources",
                "description": "I wanted to have a place where I can collect useful IT resources, and I thought it may be useful for others too."
            },
            "skills": {
                "title": "Skills",
                "description": "A dedicated page to list my skills that I have acquired over the years."
            },
            "academic": {
                "title": "Academic contributions",
                "description": "A collection of my academic contributions such as publications and presentations."
            }
        }
    },
    "contact": {
        "title": "Contact",
        "subtitle": "Send me an (encrypted) email!",
        "getInTouch": "Get in touch with me:",
        "email": {
            "title": "My email address",
            "description": "contact (at) okrim (dot) hu"
        },
        "pgp":{
            "title": "Download or copy my public key:",
            "subtitle": "You can import this public PGP key to your keychain, and then send me encrypted messages with it.",
            "download": "Download public key",
            "copy": "Copy key to clipboard",
            "asText": "View my PGP public key as text"
        }
    },
    "academic": {
        "title": "Academic contributions",
        "summary": "During my academic years I always seeked opportunities to participate in workshops, projects, school events and so on. This page summarizes all my presentations, publications and other academic activities.",
        "presentations": {
            "title": "Presentations",
            "one": {
                "title": "BirdCam project",
                "date": "June, 2021",
                "location": "Dennis Gabor Talent Support gala",
                "summary": "I presented my BirdCam project, from creating the first prototype to the final publication. My work had positive feedback and I was offere₫ to publish it in the Newsletter of The Hungarian IT Teachers' Association.",
                "description": "You can see more about my BirdCam project on the Projects page."
            },
            "two": {
                "title": "About our ‘maths for fun’ workshop",
                "date": "October 20th, 2021",
                "location": "Dennis Gabor Talent Support gala",
                "summary": "As a core member of the workshop, I gave a presentation about the workshop’s mentality, the kind of questions we look at together during the sessions and I also mentioned some discrete maths questions that I really enjoyed thinking about during the past year.",
                "description": "Another riddle I mentioned in my presentation: A street vendor sells letters carved out of wood. They do not reveal how much each letter costs, but he does provide the following information: ONE costs $1, TWO costs $2, ELEVEN costs $11. How much does the word 'TWELVE' cost?"
            },
            "three": {
                "title": "My favourite math exercises of this year’s workshop",
                "date": "June 23rd, 2022",
                "location": "Dennis Gabor Talent Support gala",
                "summary": "I represented our maths workshop, where I talked about some of my favourite problems, questions and exercises of the year.",
                "description": "Some of the topics I touched were the proof that Cantor's set's cardinality is Continuum, the importance of the precise use of terms when talking about maths, my hypothesis-tester application I wrote and demonstrated and the mathematics of the Rubik's cube."
            },
            "four": {
                "title": "How does a computer solve the Rubik’s cube?",
                "date": "December, 2022",
                "location": "Maths for fun workshop",
                "summary": "I held one of the math workshop sessions with a one hour long presentation about the algorithms of twisty puzzles, the algorithmic approach of the solution for computer programs, the principles used for solving a cube and so on.",
                "description": "Some parts of my presentation: What is a Rubik's cube, how does one solve a Rubik's cube, A* search algorithm, notations, lower- and upper bound, God's number, Thistlethwaithe's algorithm, Korf algorithm, solving the cube with computers."
            },
            "five": {
                "title": "3 reasons to learn databases",
                "date": "June 19th, 2024",
                "location": "Dennis Gabor Talent Support gala",
                "summary": "I gave a presentation about the importance of SQL and relational databases from a software developer’s point of view, I gave some practical examples where such knowledge is beneficial, and I presented the database structure of my BSc diploma work, along with its constraints and implementation.",
                "description": ""
            }
        },
        "publications": {
            "title": "Publications",
            "birdcam": {
                "title": "'BirdCam project': Building a Raspberry-Pi-based motion-sensing bird camera IoT system",
                "date": "September, 2021",
                "location": "Newsletter of The Association of Hungarian IT Teachers",
                "summary": "A detailed guide on how to build my BirdCam project from scratch, with the hardware and software configurations.",
                "description": "You can read in more detail about my BirdCam project on the Projects page."
            }
        },
        "achievements": {
            "title": "Other academic achievements",
            "one": {
                "title": "Adhered to my university’s ‘maths for fun’ workshop",
                "date": "October, 2020",
                "summary": "During my first few weeks at university I adhered to a mathematics student workshop, where I became one of the core members and I helped organising the workshop sessions for 3 years.",
                "description": "There were weekly workshop sessions where we talked about discrete maths, calculus and many math-related topics. It was the perfect place to think together, ask questions and become familiar with abstract ideas."
            },
            "two": {
                "title": "Became a Calculus teacher demonstrator",
                "date": "February, 2021",
                "summary": "During my second semester I had the honor of becoming a calculus demonstrator, where I worked together with my teacher on developing new materials and organising weekly workshops.",
                "description": "A demonstrator is like a teacher assistant. I helped with the development of calculus materials with LaTeX and RegEx, we organised weekly workshops and I also managed a school website about the workshop's activity."
            }
        }
    },
    "skills": {
        "title": "Skills",
        "subtitle": "My soft and hard skills",
        "soft": "Soft skills",
        "hard": "Hard skills",
        "languages": {
            "name": "Languages",
            "description": "Fluent in English (C1), French (C1) and Hungarian (native)."
        },
        "teamwork": {
            "name": "Teamwork",
            "description": "I enjoy collaborating with others to achieve common goals."
        },
        "learning": {
            "name": "Learning new technologies",
            "description": "I am passionate about staying updated with the latest technological advancements."
        },
        "curiosity": {
            "name": "Curiosity",
            "description": "I have a strong desire to understand how things work and to explore new ideas."
        },
        "teaching": {
            "name": "Teaching",
            "description": "I love explaining concepts and helping others learn and grow."
        },
        "precision": {
            "name": "Precise work",
            "description": "I strive for perfection and pay great attention to detail in my work."
        }
    }
}