[
    {
        "title": "Log Change Email Notifier",
        "summary": "A Spring application that examines a text file and if lines were added to the end of the file then it sends the new lines via email. Designed to work with LOG files that append lines in a file and never modify previous entries.",
        "motivation": "I have several personal projects that use log files. Many of these projects are running on headless Raspberry Pi micro computers, thus taking a look at these logs would mean connecting to them via SSH, getting to the log files, inspecting them, trying to remember what are the new lines… To fix this issue I decided to create a Java / Spring application that reads a log file, compares the number of lines in the file to the previously read number of lines, and if there are new ones, it sends an email notification to any given email address. This app can then be scheduled to run periodically to always have updates on a specific log file.",
        "functionality": "This is a wireframe that can be further modified for any specific usage. What this application does is it runs and checks if a specific text file has new lines appended at the end, and if it has then it sends an email notification with the new lines as the email’s body. It is important that this application is meant to work with log files, meaning that new lines are linearly appended to the file’s end, and nothing is ever modified. When the script is launched from a terminal, the target email address and log file can be given as parameters for easy configuration. The FROM email address can be configured in the application.properties file and is currently set for gmail addresses.",
        "challenges": [
            "I had to make sure the application is easily configured and is as lightweight as possible (to be run from a terminal with configurable options).",
            "I had to make sure the file reading and manipulation works exactly as expected."
        ],
        "futureImprovements": [
            "I was thinking about making it possible to use the application with multiple log files, but for now I just settled on using different instances of the app running for each log file.",
            "I was thinking about making it possible to use the application with multiple log files, but for now I just settled on using different instances of the app running for each log file."
        ],
        "techStack": ["Java", "Spring", "Maven", "Spring Boot Starter Mail dependency for sending the mails"],
        "folder": "log_change_email_notifier",
        "links": [
            {"name": "GitHub2", "link": "https://github.com/raczmirko/log-change-email-notifier"}
        ]
    },
    {
        "title": "Birdcam",
        "summary": "The BirdCam project was my first academic IoT project featuring a Raspberry Pi micro computer and an IP camera to take images of birds at my bird feeder. The project was a success and was later published in the journal of the Association of Hungarian IT Teachers",
        "motivation": "I have always loved animals and nature, so I had this idea of creating a motion-triggered camera system that would take pictures of the birds we feed automatically. I also wanted to crete something useful to practice some of the principles I learned during my first semester at university, such as networking or linux basics. ",
        "functionality": "The brain of the operation is a Raspberry Pi micro computer, running MotionEye for handling the motion detection. The images are taken with an IP camera connected to the Pi via the local network.",
        "challenges": [
            "Configuring the Raspberry Pi to run headless, so that I could easily SSH into the machine and control it from anywhere within the local network.",
            "Setting the motion trigger up precisely so that it doesn't trigger too often nor too few times.",
            "Building an optimal hardware setup. I have made several prototypes to finally find the one that fit me."
        ],
        "futureImprovements": [
            "Bird recognition using AI.",
            "Storing the images in the cloud for easier access"
        ],
        "techStack": ["Linux", "MotionEye"],
        "folder": "birdcam",
        "links": [
            {"name": "Publication link", "link": "https://isze.hu/wp-content/uploads/2021/09/Inspiracio2021_3.pdf"}
        ]
    },
    {
        "title": "Birdcam digital frame",
        "summary": "A digital picture frame to showcase the images my Birdcam project captured.",
        "motivation": "The Birdcam project was a success, and I wanted to show the resulting images to friends and family, but it was not convenient having to join the Birdcam, browse the photos, show it on a small mobile screen and so on, so I decided to make a custom digital frame for this purpose.",
        "functionality": "The frame is using a Rapsberry Pi Zero micro computer, which runs a custom Python slideshow app that I made to display images from a predefined folder. The Birdcam was connected to this folder over the local network via FTP, thus the frame would always have new photos the Birdcam made. I made a second version of the frame which had buttons to allow manual interaction with the slideshow, as well as a new hardware design with a glass window to expose the internals of the frame.",
        "challenges": [
            "Scaling the images so that they would fit onto the custom touchscreen of the frame, which had a special aspect ration.",
            "Writing a custom slideshow app in Python",
            "Scheduling the frame to turn on and off automatically, and to load the slideshow app on boot."
        ],
        "futureImprovements": [],
        "techStack": ["Python", "Linux"],
        "folder": "birdcam_frame",
        "links": []
    }
]